In [49]:
import pandas as pd
import numpy as np

In [7]:
#Sample data
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Ethan', 'Fiona'], 
    'Age': [25, 30, 35, 40, 28, 45],
    'City': ['New York', 'Chicago', 'San Diego', 'Chicago', 'New York', 'San Diego'],
    'Salary': [70000, 80000, 90000, 85000, 72000, 88000]

}

#Create Dataframe 
df = pd.DataFrame(data)

#Display it
df.head(10)

      Name  Age       City  Salary
0    Alice   25   New York   70000
1      Bob   30    Chicago   80000
2  Charlie   35  San Diego   90000
3    Diana   40    Chicago   85000
4    Ethan   28   New York   72000
5    Fiona   45  San Diego   88000

 Exercise 1: Filter rows

    Get all rows where the salary is greater than 75,000.

In [13]:
df_salary_filter = df[df['Salary'] > 75000]
print(df_salary_filter)

      Name  Age       City  Salary
1      Bob   30    Chicago   80000
2  Charlie   35  San Diego   90000
3    Diana   40    Chicago   85000
5    Fiona   45  San Diego   88000

Exercise 2: Group and aggregate

    Find the average salary per city.

In [20]:
avg_salary_city = df.groupby('City')['Salary'].mean()
print(avg_salary_city)

City
Chicago      82500.0
New York     71000.0
San Diego    89000.0
Name: Salary, dtype: float64

Exercise 3: Add a column

    Add a new column senior which is True if age â‰¥ 35, else False.

In [37]:
df['Senior'] =df['Age'] >= 35

print(df)

      Name  Age       City  Salary  Senior
0    Alice   25   New York   70000   False
1      Bob   30    Chicago   80000   False
2  Charlie   35  San Diego   90000    True
3    Diana   40    Chicago   85000    True
4    Ethan   28   New York   72000   False
5    Fiona   45  San Diego   88000    True

Exercise 4: Sort values

    Sort the DataFrame by salary descending.

In [40]:
df.sort_values('Salary', ascending=False)

      Name  Age       City  Salary  Senior
2  Charlie   35  San Diego   90000    True
5    Fiona   45  San Diego   88000    True
3    Diana   40    Chicago   85000    True
1      Bob   30    Chicago   80000   False
4    Ethan   28   New York   72000   False
0    Alice   25   New York   70000   False

 Exercise 5: Count distinct values

    How many unique cities are there?

In [45]:
unique_cities= df['City'].nunique()

print(f'There are {unique_cities} unique cities :)')

There are 3 unique cities :)

Expanding the df to make mor exercises:

Add new column: 'Hire_Date'
Add some NaN values for missing salary example

In [50]:

df['Hire_Date']= ['2020-05-15', '2019-07-01', '2021-01-10', '2018-03-20', '2022-09-01', '2017-12-11']

# Convert 'Hire_Date' to datetime
df['Hire_Date'] = pd.to_datetime(df['Hire_Date'])

# Add some NaN values for missing salary example
df.loc[1, 'Salary'] = np.nan  # Bob's salary is missing

df

      Name  Age       City   Salary  Senior  Hire_Date
0    Alice   25   New York  70000.0   False 2020-05-15
1      Bob   30    Chicago      NaN   False 2019-07-01
2  Charlie   35  San Diego  90000.0    True 2021-01-10
3    Diana   40    Chicago  85000.0    True 2018-03-20
4    Ethan   28   New York  72000.0   False 2022-09-01
5    Fiona   45  San Diego  88000.0    True 2017-12-11

In [ ]:
# Convert 'Hire_Date' to datetime
df['Hire_Date'] = pd.to_datetime(df['Hire_Date'])

# Add some NaN values for missing salary example
df.loc[1, 'Salary'] = np.nan  # Bob's salary is missing